# Data Frames

In [4]:
import numpy as np
import pandas as pd

In [20]:
from numpy.random import randn

In [22]:
np.random.seed(101)

In [24]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [26]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

A data frame is basically a bunch of series that share an index

# Indexing and Selection

In [32]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

If you look above we have a 'W' Series. To prove this satatement look below.

In [38]:
type(df['W'])

pandas.core.series.Series

But the 'df' it self is a DataFrame. And to prove this statement look below.

In [41]:
type(df)

pandas.core.frame.DataFrame

In [43]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

# Multiple colums

To get multiple colums back you can pass in a list of colums

In [49]:
df[['W','Z']]

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

So meaning if multiple colums are reqested then a DataFrame is returned otherwise if only one is requested then a series is returen.

# Creating a new colum
We can do this by using arithmatic

In [86]:
 df['new'] = df['W'] + df['Y']

In [62]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

# Removing colums
Lets remove the new colum below.

In [70]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

Now the above does not permanentaly remove the colum. Cause if you want to permently remove it you use the inplace=True

In [88]:
df.drop('new',axis=1,inplace=True) #This permanantly removes the 'new' colum

In [90]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Removing Rows

In [97]:
df.drop('E',) # Note that will drop row ''E

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [99]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [103]:
df.shape

(5, 4)

# Selectig a row from a Data Frame

In [111]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

This shows us that yhe rows are also series in the manner in which they are returned

## The second way to grab a row

In [121]:
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

## Getting a certain value

In [129]:
df.loc['B','Y'] #In this example we are getting the value at Row 'B' and colum 'Y'

-0.8480769834036315

In [141]:
df # Lets say you want the subset of A,B,C rows and W,Y,Z colums just pass in a list of rows and colums that you want.

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [143]:
df.loc[['A',B,C],[W,Y,Z]]

NameError: name 'A' is not defined